'use strict'

const PRODUCTS = [

    {
        brand: 'IPhone',
        model: '15pro',
        screen: 6.1, // Диагональ (дюймы)
        camera: 48, // Основная камера (Мега пиксели)
        battery: 3200, // Милли Ампер/час
        RAM: 8, // ГБт (оперативная память)
        ROM: 128, // ГБт (постоянная память)
        image: "iphone_15pro.png",
        price: 4500, // цена (БелРублей)
    },

    {
        brand: 'Samsung',
        model: 'Galaxy S24 ultra',
        screen: 6.8, // Диагональ (дюймы)
        camera: 200, // Основная камера (Мега пиксели)
        battery: 5000, // Милли Ампер/час
        RAM: 12, // ГБт (оперативная память)
        ROM: 512, // ГБт (постоянная память)
        image: "samsung_galaxy_s24_ultra.webp",
        price: 5500, // цена (БелРублей)
    },

    {
        brand: 'Xiaomi',
        model: '14 pro',
        screen: 6.73, // Диагональ (дюймы)
        camera: 50, // Основная камера (Мега пиксели)
        battery: 4880, // Милли Ампер/час
        RAM: 12, // ГБт (оперативная память)
        ROM: 256, // ГБт (постоянная память)
        image: "xiaomi_14pro.webp",
        price: 2200, // цена (БелРублей)
    },

    {
        brand: 'Poco',
        model: 'X3 pro',
        screen: 6.67, // Диагональ (дюймы)
        camera: 48, // Основная камера (Мега пиксели)
        battery: 5160, // Милли Ампер/час
        RAM: 6, // ГБт (оперативная память)
        ROM: 128, // ГБт (постоянная память)
        image: "poco_x3_pro.jpg",
        price: 500, // цена (БелРублей)
    },

    {
        brand: 'Nothing Phone',
        model: '2',
        screen: 6.7, // Диагональ (дюймы)
        camera: 50, // Основная камера (Мега пиксели)
        battery: 4700, // Милли Ампер/час
        RAM: 12, // ГБт (оперативная память)
        ROM: 256, // ГБт (постоянная память)
        image: "нафин.jpeg",
        price: 2200, // цена (БелРублей)
    },

    {
        brand: 'Poco',
        model: 'X3 pro',
        screen: 6.67, // Диагональ (дюймы)
        camera: 48, // Основная камера (Мега пиксели)
        battery: 5160, // Милли Ампер/час
        RAM: 6, // ГБт (оперативная память)
        ROM: 128, // ГБт (постоянная память)
        image: "poco_x3_pro.jpg",
        price: 500, // цена (БелРублей)
    },
]